test/performance/benchmarks/real-traffic-test/results/preempt-k8s/10_seconds-20_interfering/2026-02-23_19-53-45/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: true
Sources of Interference: 20
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.986s, 59.981s, 5.53ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.026ms, 124.029ms, 6.42ms, 10.849ms, 699.732ms, 3.126s, 4.284s
Bytes In      [total, mean]                     29138549, 9712.85
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0
Criticality Level: 1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.874ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.246ms, 104.498ms, 6.512ms, 10.914ms, 443.982ms, 2.837s, 3.262s
Bytes In      [total, mean]                     2914475, 9714.92
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1
Criticality Level: 2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.468ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.252ms, 95.327ms, 6.531ms, 10.542ms, 256.221ms, 2.672s, 3.143s
Bytes In      [total, mean]                     2913711, 9712.37
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2
Criticality Level: 3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.25ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.057ms, 97.965ms, 6.545ms, 10.676ms, 309.283ms, 2.724s, 3.164s
Bytes In      [total, mean]                     2913686, 9712.29
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3
Criticality Level: 4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.283ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.095ms, 102.457ms, 6.549ms, 10.221ms, 390.244ms, 2.784s, 3.302s
Bytes In      [total, mean]                     2913375, 9711.25
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4
Criticality Level: 5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.883ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.026ms, 87.377ms, 6.367ms, 10.022ms, 130.46ms, 2.531s, 3.036s
Bytes In      [total, mean]                     2914533, 9715.11
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5
Criticality Level: 6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.811ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.26ms, 170.857ms, 6.387ms, 11.09ms, 1.41s, 3.851s, 4.261s
Bytes In      [total, mean]                     2913357, 9711.19
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6
Criticality Level: 7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 7.212ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.251ms, 161.084ms, 6.481ms, 13.121ms, 1.319s, 3.705s, 4.136s
Bytes In      [total, mean]                     2913251, 9710.84
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7
Criticality Level: 8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.475ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.163ms, 81.462ms, 6.271ms, 11.539ms, 70.568ms, 2.402s, 2.854s
Bytes In      [total, mean]                     2914211, 9714.04
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8
Criticality Level: 9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.507ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.239ms, 168.646ms, 6.467ms, 11.511ms, 1.448s, 3.843s, 4.265s
Bytes In      [total, mean]                     2913719, 9712.40
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9
Criticality Level: 10

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.53ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.089ms, 170.612ms, 6.137ms, 9.945ms, 1.455s, 3.842s, 4.284s
Bytes In      [total, mean]                     2914231, 9714.10
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: